# Используем официальный образ Node в качестве базового образа
FROM node:14

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы package.json и package-lock.json
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем все файлы из текущего каталога в рабочую директорию контейнера
COPY . .

# Собираем приложение
RUN npm run build

# Указываем порт, который будет использоваться приложением
EXPOSE 3000

# Команда для запуска приложения в контейнере
CMD ["npm", "start"]